do

function run(msg, matches)
if msg.to.type == 'channel' and is_momod(msg) then
  return ''..[[
➖➖➖➖➖➖➖
✔️لیست دستورات قفلی:
➖➖➖➖➖➖➖
❌》قفل کردن لینک
✔️》بازکردن لینک
〽️در صورت قفل اگر ممبرها لینکی ارسال کنند لینک حذف خواهدشد.

❌》قفل کردن استیکر
✔️》بازکردن استیکر
〽️درصورت قفل ارسال استیکر ممنوع میشود.

❌》قفل کردن شکلک
✔️》بازکردن شکلک
〽️درصورت قفل ارسال شکلک ممنوع میشود.

❌》قفل کردن عربی
✔️》بازکردن عربی
〽️درصورت قفل چت عربی ممنوع میشود.

❌》قفل کردن انگلیسی
✔️》بازکردن انگلیسی
〽️درصورت قفل چت انگلیسی ممنوع میشود.

❌》قفل کردن مخاطب ها
✔️》بازکردن مخاطب ها
〽️درصورت قفل ارسال مخاطب (شرکردن شماره)ممنوع میشود.

❌》قفل کردن اسپم
✔️》بازکردن اسپم
〽️درصورت قفل کاربران با دادن اسپم(هرزنامه)از گروه حذف خواهند شد.

❌》قفل کردن راست به چپ
✔️》بازکردن راست به چپ
〽️درصورت قفل نوشتن راست به چپ ممنوع میشود.

❌》قفل کردن ورودوخروج
✔️》بازکردن ورودوخروج
〽️درصورت قفل ورود و خروج اعضا نمایش داده نمیشود.

❌》قفل کردن سختگیرانه
✔️》بازکردن سختگیرانه
〽️درصورت قفل اگر کاربری خلاف قوانین عمل کند از گروه حذف میشود.(مثلا اگرلینک قفل باشد کاربر با دادن لینک از گروه حذف میشود)

❌》قفل کردن ورود
✔️》بازکردن ورود
〽️درصورت قفل ورود به گروه ممنوع میشود.(با ورود از گروه حذف میشود)

❌》قفل کردن خروج
✔️》بازکردن خروج
〽️درصورت قفل خروج از گروه ممنوع میشود.(با خروج از گروه بن میشود)

❌》قفل کردن ممبر
✔️》بازکردن ممبر
〽️درصورت قفل ورود و خروج به گروه ممنوع میشود.(درصورت ورود از گروه حذف و درصورت خروج بن میشود)

❌》قفل کردن فلود
✔️》بازکردن فلود
〽️درصورت قفل دادن پی ام پشت سرهم و تکراری در گروه ممنوع میشود.

❌》قفل کردن ربات ها
✔️》بازکردن ربات ها
〽️درصورت قفل اد کردن ربات در گروه ممنوع میشود.

❌》قفل کردن فحش
✔️》بازکردن فحش
〽️درصورت قفل فحاشی در گروه ممنوع میشود.

❌》قفل کردن فوروارد
✔️》بازکردن فوروارد
〽️درصورت قفل فوروارد کردن در گروه ممنوع میشود.

❌》قفل کردن اپراتور
✔️》بازکردن اپراتور
〽️درصورت قفل تبلیغ شارژ ممنوع میشود.

❌》قفل کردن تگ
✔️》بازکردن تگ
〽️درصورت قفل ارسال تگ(#) در گروه ممنوع میشود.

❌》قفل کردن همه
✔️》بازکردن همه
〽️قفل و باز کردن همه تنظیمات بالا.

〰 با قفل هر یک از موارد پایین ارسال آن در گروه ممنوع میشود.
❌》قفل کردن چت
✔️》بازکردن چت

❌》قفل کردن عکس
✔️》بازکردن عکس

❌》قفل کردن فایل
✔️》بازکردن فایل

❌》قفل کردن فیلم
✔️》بازکردن فیلم

❌》قفل کردن آهنگ
✔️》بازکردن آهنگ
➖➖➖➖➖➖➖
➰ ʝօìղ մʂ ìժ çհ :
➰ @antispamandhack
➖➖➖➖➖➖➖ ]]
end
end
return {
  description = "Robot and Creator About", 
  usage = "/ver : robot info",
  patterns = {
    "^[!#/]راهنمای قفلی$",
    
  }, 
  run = run 
}

end









